## 🏗️ Terraform Plan Preview

## 📋 Terraform Plan Summary

### Resource Changes

- ✅ **Resources to Add:** 9
- 🔄 **Resources to Change:** 0
0
- ❌ **Resources to Destroy:** 0
0

<details>
<summary>📄 Full Plan Output (click to expand)</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "protein-classifier-terraform-locks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Description" = "DynamoDB table for Terraform state locking"
          + "Name"        = "protein-classifier-terraform-locks"
        }
      + tags_all         = {
          + "Description" = "DynamoDB table for Terraform state locking"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-terraform-locks"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:us-west-2:462498369025:key/e9b37450-f4df-45d6-a336-aefd3b1d0896"
        }
    }

  # aws_ecr_lifecycle_policy.api will be created
  + resource "aws_ecr_lifecycle_policy" "api" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "main-",
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "protein-classifier-api"
    }

  # aws_ecr_repository.api must be replaced
-/+ resource "aws_ecr_repository" "api" {
      ~ arn                  = "arn:aws:ecr:us-west-2:462498369025:repository/protein-classifier-api" -> (known after apply)
      + force_delete         = true
      ~ id                   = "protein-classifier-api" -> (known after apply)
        name                 = "protein-classifier-api"
      ~ registry_id          = "462498369025" -> (known after apply)
      ~ repository_url       = "462498369025.dkr.ecr.us-west-2.amazonaws.com/protein-classifier-api" -> (known after apply)
        tags                 = {
            "Description" = "Docker images for protein classifier API"
            "Name"        = "protein-classifier-api"
        }
        # (2 unchanged attributes hidden)

      ~ encryption_configuration {
          ~ encryption_type = "AES256" -> "KMS" # forces replacement
          + kms_key         = "arn:aws:kms:us-west-2:462498369025:key/977453ad-d07d-4185-8958-838e88dd37fb" # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-west-2:462498369025:cluster/protein-classifier-api-1-0-0-prod-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "protein-classifier-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "protein-classifier-api-service"
        }
      + tags_all                           = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api-service"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "protein-classifier-api"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:462498369025:targetgroup/protein-classifier-ecs-tg/8a6ccffd3d4c3116"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0822fb8754073fb32",
            ]
          + subnets          = [
              + "subnet-034dbf0d24493ddf3",
              + "subnet-0a9d6de07abc7f763",
            ]
        }
    }

  # aws_ecs_task_definition.api will be created
  + resource "aws_ecs_task_definition" "api" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::462498369025:role/protein-classifier-ecs-task-execution-role"
      + family                   = "protein-classifier-api"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "protein-classifier-api-task"
        }
      + tags_all                 = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api-task"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + task_role_arn            = "arn:aws:iam::462498369025:role/protein-classifier-ecs-task-role"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_iam_role_policy.github_actions_policy will be created
  + resource "aws_iam_role_policy" "github_actions_policy" {
      + id          = (known after apply)
      + name        = "github-actions-deployment-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "protein-classifier-github-actions-role"
    }

  # aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "protein-classifier-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-052e25ef7707ee664",
        ]
      + subnets                                                      = [
          + "subnet-067b8b58bdacbd8ef",
          + "subnet-097cbe6706c0bba59",
        ]
      + tags                                                         = {
          + "Name" = "protein-classifier-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-alb"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "protein-classifier-alb-logs-462498369025"
          + enabled = true
          + prefix  = "alb-logs"
        }
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-west-2:462498369025:certificate/bd8958a6-a142-42df-82bb-1cdb82456ff6"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-Ext1-2021-06"
      + tags_all                                                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:462498369025:targetgroup/protein-classifier-ecs-tg/8a6ccffd3d4c3116"
          + type             = "forward"
        }
    }

  # aws_route53_record.api will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.proteinclassifier.com"
      + type            = "A"
      + zone_id         = "Z0960642JHAEZB1G2JKV"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 10 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + alb_dns_name            = (known after apply)
  ~ ecr_repository_url      = "462498369025.dkr.ecr.us-west-2.amazonaws.com/protein-classifier-api" -> (known after apply)
```
</details>

### 🔍 Key Changes Detected

- 🐳 **ECS Service** changes detected
- ⚖️ **Load Balancer** changes detected
- 🔑 **IAM** changes detected

### ✅ Validation Status

- **Format Check:** ✅ Pass
- **Init:** ✅ Pass
- **Validate:** ✅ Pass
- **Plan:** ✅ Pass


---
<sub>💡 This plan preview helps you review infrastructure changes before applying them.</sub>
